Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 游震天派人把他抓起来，比想象中还容易，但一直问不出传族之宝的踪迹，因为上面有族中那些老怪物的压力，所以他无法对游小默的父亲用刑。
en_us: You ZhenTian sent people to capture him and it was easier than he had expected. However, he had always been unable to get information on the whereabouts of the Inheritance Jewel. This was because those old monsters within the clan were pressuring him from above, preventing him from torturing it out from You XiaoMo's father.

source: 游震天猛地将茶桌上的瓷器扫落在地，一种被耍得团团转的愤怒始终在他心头挥之不去，特别是在苍盟举办的生日宴会上，竟然被他们光明正大的溜走。
en_us: You ZhenTian suddenly swept off the chinaware on the table onto the floor. The wrath bubbling up after he had been fooled was impossible to rid from his mind. Especially when he though of how they had actually let them openly slip away during the birthday banquet organized by the Cang Alliance.

source: 游震天的脸黑了。
en_us: You ZhenTian's face turned black.

source: 游震天看到游小默藏到凌霄身后，这才将目光移到凌霄身上，圣境高星的自信令他完全轻视凌霄的战斗力。
en_us: You ZhenTian's gaze only moved to Ling Xiao when he saw You XiaoMo hide behind him. His confidence from being a Sacred high-star expert made him completely underestimate Ling Xiao's combat strength.

source: 游震天看穿他的意图，冷哼一声，“不自量力！
en_us: You ZhenTian saw through his intentions and sneered coldly. "Over-confident!

source: 游震天眼中闪过一丝怒意，“立刻派人去找，两人不可能无缘无故消失，一定要给老夫找出来。”
en_us: A trace of fury flashed through You ZhenTian's eyes, "Dispatch someone to find them immediately. It's impossible for two people to disappear without any reason. You must find them."

source: 游震天眼神一厉，“你凭什么这么认为？”
en_us: You ZhenTian's gaze sharpened. "Why do you believe so?"

source: 游震天知她说得有理，“那依夫人之见，该如何做？”
en_us: You ZhenTian knew that what she was saying was reasonable. "Then based on your judgment, how should we proceed?"

source: 游震天神色阴晴不定，铁青着脸连续喊了三个好字，“傅苍穹，我游震天记住你今天的话！”
en_us: You ZhenTian's expression was sinister as he lividly shouted 'good' three times in succession, "Fu CangQiong, I, You ZhenTian, will remember your words today!"

source: 游震天立刻指使着碧妖蛇朝凌霄飞过去。
en_us: You ZhenTian immediately instructed the Jade Devil Snake to fly towards Ling Xiao.

source: 游震天站起来，眼睛逼视着他：“他说的可是真的？”
en_us: You ZhenTian stood, looking down at him. "What he said is true?"

source: 游震天竟然没有发脾气，脸庞的怒气也淡了些许。
en_us: You ZhenTian surprisingly didn't erupt, and the anger on his face even faded.

source: 游震天考虑再三，终于没有再出价。
en_us: You ZhenTian considered it again and, in the end, decided against bidding.

source: 游震天背着双手，脸色阴沉得能滴水，但是眼神却好似跳动着几簇火焰一样，目光灼灼的盯着游小默，凌霄则直接被他无视了，两人在他看来已经是瓮中之鳖，他现在更想知道游小默到底有没有开启那件东西。
en_us: You ZhenTian clasped his hands behind his back, expression extremely dark, but several flickers of flame seemed to be leaping in his eyes. His gaze shined as he stared at You XiaoMo, and Ling Xiao was directly ignored by him. To him, the two of them were already essentially trapped. All he wanted to know now was whether or not You XiaoMo had opened that item.

source: 游震天脸色铁青，在晶石板上第三次输入价格，六亿已经超出许多，他不可能再漫天加价，只输了个保守的价格，随即眼神阴狠的盯着游小默，好像在说‘有种你再加价’。
en_us: You ZhenTian's face was livid as he entered his bid for the third time on the crystal slab. The price of six hundred million was too excessive. He could not limitlessly raise the price (漫天加价) again and just entered a conservative price. Following which, he then glared viciously at You XiaoMo as if he was saying 'increase your bid again if you have the guts'.

source: 游震天表情不变，双目却十分深沉。
en_us: You ZhenTian's expression did not change, yet his gaze was extremely dark.

source: 游震天要求彻查今天来参加宴会的宾客，看看不那些提前离席的碍于游震天的身份，加上确实有人死在绵绵山，傅苍穹便让方迟尧熊笑几个徒弟彻查。
en_us: You ZhenTian wanted to do a full investigation of the attending guests, checking on those who had left early. Because of You ZhenTian's identity and the fact that someone really did die, Fu CangWan had Fang ChiYao, Xiong Xiao and his other students do a full investigation.

source: 游震天见多识广，听到手下的形容立刻联想到吞噬神火，只有这个原因才能解释姬芮为什么会败。
en_us: You ZhenTian was experienced and knowledgeable, and when he heard what happened, he instantly connected it to the engulfing Godfire. This was the only reason that could explain why Ji Rui would be defeated.

source: 游震天露出一丝凝重之色，又是圣境强者。
en_us: You ZhenTian grew solemn. Scared level again.

source: 游震天面上波澜不惊，“什么人竟然敢对阴阳谷的人下手？”
en_us: You ZhenTian's expression did not waver. "Who is it that dared attack someone from the YinYang Family?"

source: 游震天面无更让看了他三秒，江流对他来说不过是个不值得一提的小人物，量他也不敢存心欺骗，遂让星罗城主一甘人等下去，直到大厅只剩下他，夫人，江流三人。
en_us: You ZhenTian scrutinized the other for a few seconds. Jiang Liu, to him, was someone not even worth mentioning and wouldn't dare lie. So he had everyone else, including the City Master of Xing Luo City, leave and wait for them. In the end, all that was left in the hall was him, his wife and Jiang Liu.

source: 游震天面无表情的加了价，四亿又变成了四亿五千万。
en_us: You ZhenTian expressionlessly increased his bid. The bid price of four hundred million then became four hundred and fifty million.

source: 游震天顾不得追查风迟云到底被谁带走，带着赤血家族的弟子，立刻向傅苍穹告辞了。
en_us: You ZhenTian didn't have the time to pursue who took Feng ChiYun. He immediately bid Fu CangWan farewell and left with his people.

source: 游青山咽了一口水，点点头。
en_us: You QingShan swallowed thickly, nodding.

source: 游青山立刻将大庄园的事情说了一遍，当然只能说给游震天一人听。
en_us: You QingShan immediately relayed everything that had occurred back at the estate. Of course, he only told You ZhenTian.

source: 湖泊依旧噗嗤噗嗤的冒着充满寒气的泡泡。
en_us: The lake boiled and released bubbles full of cold air.

source: 湿湿的果核，一看就是刚吃完的。
en_us: With a look at the moist pit of the fruit, one could tell that it had just been finished.

source: 滕梓叶是滕梓心的哥哥，他的天赋虽然不如滕梓心，但是靠着后天的努力，他的成就却不比滕梓心差。
en_us: Teng ZiYe was Teng ZiXin’s older brother. Though his natural talent wasn’t as good as Teng ZiXin, he was just as good with the effort he showed.

source: 滕梓心捏紧拳头，眼中的震撼缓缓褪去，片刻后就被愤怒替代了。
en_us: Teng ZiXin clenched her fist, the shock retreating and being replaced by rage.

source: 滕梓心淡淡的看了他一眼，说：“别忘了，他的师傅可是我师公。”
en_us: Teng ZiXin glanced at him, saying, “Don’t forget, his master is my grandmaster.”

source: 滕梓心深呼吸了一口气，现在她只能希望，游小默的灵丹品质并不精纯，唯有这样，分数才不会被拉开。
en_us: Teng ZiXin took a deep breath. She could only hope that You XiaoMo’s pill wasn’t of a good quality. That was the only way the difference in their points wouldn’t increase further.

source: 滕梓心的眼睛顿时异彩连连，她还有反败为胜的机会，得到自己想到的答案后，她就退了回去。
en_us: Teng ZiXin’s eyes lit up. She still had a chance to turn the tides. After obtaining the answer she wanted, she stepped back.

source: 滕梓心走出来说道：“五长老，请问积分要怎么计算？”
en_us: Teng ZiXin stepped forwards, asking, “Fifth Elder, may we know how the points are calculated?”

source: 滕蛟一声‘好’刚落下，两人便犹如离弦的箭朝凌霄冲了过去。
en_us: As the word “alright,” left Teng Jiao’s lips, the two of them shot forwards towards Ling Xiao like arrows.

source: 滕蛟得意地笑道，“凌霄，不知道你有没有想过，你也会有这一天！”
en_us: Teng Jiao gave a triumphant smile, saying, “I don’t know if you considered that you would fall to a situation like this, Ling Xiao!”

source: 滕蛟的心脏不规则地咯噔了一下，心里有个声音在告诉他危险，但是挥出去的拳头却已经改变不了。
en_us: Teng Jiao’s heart skipped a beat. A voice inside his head told him that this wasn’t good, but it was too late to stop his strike now.

source: 滕蛟脸色微微一变，挥出一拳便朝凌霄的左脸打去，这个动作既简单又直接，虽然没有什么技巧可言，但是在他的拳头上却蕴含着一股厉害的力量，怕是连脚下的擂台都承受不住。
en_us: Teng Jiao’s expression shifted just slightly, swinging his fist at the left side of Ling Xiao’s face. The movement was simple and direct with little technique, but it was a powerful strike that even the arena floor below them might not be able to take.

source: 满满一桌，香气扑鼻，游小默比较注重口腹之欲，顿时看得食指大动，这些日子他也没怎么吃过东西，因为西境不必南陆和中天，这里的城镇比较少。
en_us: The table was brimming with food and the fragrance of the dishes assailed the nose. You XiaoMo paid more attention to his desire for good food and was staring at the food with avariciousness and insatiability. He has not eaten much these days because Xi Jing had lesser cities and towns unlike the South Continent or Zhong Tian.

source: 漩涡越转越小，很快便凝聚成一个小点，随即爆发出一道极威的强光，若不是发生在游小默的识海里，这道强光足以把人的眼睛刺瞎。
en_us: The whirlpool became smaller and smaller until it condensed into a dot, then an extremely bright light erupted. If it wasn't happening withint You XiaoMo's sea of consciousness, it would have been bright enough to turn someone blind.

source: 漫天黑色瘴气之中坐落着一座银光闪闪的洞府，不同于其他洞府隐匿于山体之中，恨不得别人看不见，这座洞府恰恰相反。
en_us: A cave dwelling (洞府) glowing with silver light sat amidst a sky full of black miasma. It wasn't hidden in the mountain like other cave dwellings, preventing other people from seeing it. Instead, this cave dwelling was essentially the complete opposite.

source: 激动不已的水元素之心立刻冷静下来，多年来它一直无法化形，就是因为能量不够，总是无法冲破那层束缚，如今上天给了它一个机会，它一定要好好把握。
en_us: The extremely excited Water Elemental Essence instantly calmed back down. For many years, it had been unable to transform because it didn't have enough energy, so it had never been able to break through that layer of restriction. Now the Heavens gave him this opportunity, and he definitely would have to grasp it well.

source: 激动的游小默并没有注意到，星罗城主嘴角挂着一丝不以为意的冷笑，表情根本就不相信他的说辞，好像看跳梁小丑在演戏一样。
en_us: What the excited You XiaoMo didn't realize was that the City Master of Starfall City was smiling coldly at him. He clearly didn't believe what You XiaoMo had said, watching him as if he were like a clown.

source: 火很快就生好了，游小默把整只兔子兽切成四大块分别架上四处火堆，两人虽然吃不完一米多高的兔子兽，但是剩下的兔子兽可以存放在空间里，空间有保鲜功能，而且做成肉干也不错。
en_us: The fire was soon ready. You XiaoMo cut the entire rabbit into four pieces, skewered them and placed them all around the fire. The remaining rabbit meat could be stored in his dimension even if they couldn't finish the more than one meter tall rabbit beast. His dimension had the function to retain freshness and the meat was also delicious when turned into jerky.

source: 火焰仿佛有意识一般，就像烧刑七的手臂一扬，姬云琅两条腿直接被融化了，可以预见他将会变成一个没有腿的瘸子。
en_us: It was as if the fire had its own consciousness. Just like the arm of a 烧刑七 (??? I dunno what this is), Ji YunLang's legs were melted right away, and they could foresee that he would turn into a legless cripple.

source: 火焰像是有意识一般，眼看着就要蔓延至全身，黑熊心一狠，直接把自己的右手臂给砍掉了。
en_us: As if the flame had intellengience, it was about to spread across his body. Hei Xiong braced (心一狠) himself and cleanly cut off his right arm.

source: 火辣辣的太阳升到半空，刺眼的阳光就像火苗，照在围堵在城门附近的人身上，顿时犹如添了一把火柴，心中的火烧得更旺了。
en_us: The burning sun rose to the middle of the sky. The blinding sunlight was like embers, raining down on the people crowded at the city gates, adding oil to the fires that burned in their hearts.

source: 火鸡宴和平时吃一只两只不一样，一桌火鸡宴需要十只左右才能做得出来，结果可想而知。
en_us: A turkey feast was different from just eating one or two turkeys like normal. One table at the turkey feast required at least ten or so turkeys, so the results were easy to imagine.

source: 灵丹的价值比灵草更高，所以除非对方是一名丹师，否则多数人只要灵晶，灵丹或者功法技法，这点倒是不假。
en_us: Magic pills were more valuable than magic herbs, so unless the other was a mage, most people would want spirit gems, magic pills, or soul and skill techniques. That was true.

source: 灵山八府乃是桃源一绝，分别代表着奇门遁甲的八门，坐落于灵山八个角落，整座灵山唯独八府没有遵从地势高低的分配。
en_us: The Eight Mansions were consider the focal point of the Peach Blossom. They each represented a 'door' of the Qimen Dunjia (奇门遁甲) and was placed in eight corners of the spirit mountain. Only the Eight Mansions didn't follow the rule of altitude.

source: 灵山的天地灵气很浓郁，他们也要把握这个机会，两只分别找了间石室。
en_us: The Heaven and Earth spiritual energy of the Spirit Mountain was very rich. They too should seize this opportunity, so the two separated to find a stone room.

source: 灵山的桃花并不是普通的桃花，桃花绽放后散发着一股很浓郁的香气，这种香气结合灵山的天地灵气似乎有加速修炼的作用。
en_us: The peach blossoms on the Spirit Mountains were not ordinary peach blossoms. After the peach blossoms bloomed, they would release a rich fragrance. This fragrance was linked to (结合) the Heaven and Earth spiritual energy (天地灵气) of the Spirit Mountain, and appeared to have the effect of raising one's cultivation.

source: 灵山的洞府是地势越高就越好，天地灵气也一样，越往上就越浓郁。
en_us: The higher the Immortal’s Cave was in the Spirit Mountain, the better it was. It was the same for the Heaven and Earth spiritual energy, the higher one went, the thicker it was.

source: 灵山第六府，它的主人原是一名彩级六品丹师，品阶极高。
en_us: The sixth mansion was owned by a Grade Six Rainbow Level mage, incredibly powerful.

source: 灵山还有三个多月就会关闭，如果现在不闭关修炼，接下来时间可能会不够，要是时间一到，中途被打断是很危险的。
en_us: There was still three months before the Spirit Mountain would be sealed off. If they did not go into secluded cultivation now, there may not be enough time later. It would be very dangerous if the time was up and they were interrupted mid-way.

source: 灵水一入炉鼎，炉鼎周遭的灵气就剧烈的波动了起来，持续了大概十秒的样子，由于周围的人都在专注炼丹中，所以没几个人注意到这种情况。
en_us: As soon as the spiritual water entered the cauldron, the spiritual energy around the cauldron started to pulse wildly for a full ten seconds or so. But because everyone around her was focused on refining pills, no one noticed.

source: 灵水湖一如既往，湖面非常平静，一丝涟漪都没有。
en_us: The spiritual water lake was the same as ever. The surface was extremely calm without even a ripple.

source: 灵水的功效所有丹师都知道，只要在炼的灵丹中加入几滴灵水，就能百分之百的提高炼丹的成功率和些许品质，除此之外，灵水还能在灵魂之力不够的时候进行补充。
en_us: All mages knew the effects of spiritual water. If they added a few drops to the pill they were refining, then they could increase their success rate and improve the quality of the pill without fail. Apart from that, spiritual water could also replenish one’s soul force.

source: 灵水确实是好东西，然而滕梓心并不知道。
en_us: Spiritual water was great, but Teng ZiXin didn’t know…

source: 灵玄龟则生活在活水河界里，那是西境最大最长的河流，河流的水被人称为活水，这里的活水不是指什么救活人的水，而是可以取走人或妖兽的性命的水。
en_us: The Black Spirit Tortoise lived in the Living Waters River Boundary (活水河界). This was the largest and longest river in Xi Jing. The water in the river was known as the Living Waters. The Living Waters here did not refer to water that saved the living, rather, it was water that could take the lives of humans and demon beasts.

source: 灵草堂共分为四个区，分别是第几区，中级区，高级区和顶级区，对应灵草的等级，到达高级区，门口就有人守着了。
en_us: There was four sections in the marketplace, low, middle, high, and pinnacle sections. It corresponded to the level of herbs sold and by the high section, there was guards.

source: 灵草堂的李管事早在半个月前就在等着他们了，原因是黑莲草已经找到了，这件事多亏了苏朗。
en_us: Manager Li of the Magic Herb Shop was already waiting for them since half a month ago, having found the black lotus herb, thanks to Su Lang.

source: 灵草已经趋近成熟，正常发展的话，再过几天就可以成熟了。
en_us: The magic herbs were already approaching maturity. If it developed normally, it would be mature in a few days.

source: 灵草数量其实没有增加多少，但是有的丹方的步骤却多出四五十步，原因是多数灵草需要分割成数份再与其他灵草融合，有些的处理方法也跟其他灵草不同等等，难道比十级灵丹要高出两三倍。
en_us: There wan't much more magic herbs added but some recipes had forty/fifty more steps. That was because many magic herbs had to be splited into parts before it could mix with the other herbs and some had unique handling methods, etc. (处理方法) Therefore, its difficulty was two or three times more than that of a level ten magic pill.

source: 灵酒和配方最后都落到游小默手里。
en_us: In the end, both the recipe and the wine fell into You XiaoMo's hands.

source: 灵酒的底价是二十万灵晶。
en_us: The base line price was two hundred thousand spirit gems.

source: 灵酒的等级颇高，所需要的灵草有几十种，而且都是高级灵草，有两株还是顶级灵草，成本很高，然而价格却连成本也没有，难怪通天大陆没几个人愿意用灵草来酿酒，灵酒师也没几个。
en_us: The spirit wine was of a high level, so it needed dozens of kinds of magic herbs. Furthermore, they were all high-grade magic herbs. Two stalks were even transcendent level magic herbs. The production cost was very high, and the price did not even cover the cost. No wonder few people in the TongTian Continent were willing to use magic herbs to make wine, and few spirit wine sommeliers were willing to use magic herbs.

source: 灵魂之与人是根本，同时也是脆弱的。
en_us: The soul was the foundation of a person, and fragile.

source: 灵魂之力后继无力，炼丹时甚至会出现堵塞或凝滞的现象，导致他现在炼丹的成功率不到百分之十，要不是因为他还有那么点价值，他早就被赤血家族给抛弃了。
en_us: Using soul force weakened him, and when he tried to refine pills, it would congest or freeze, reducing his success rate to lower than ten percent. If it wasn't for what little value he still held, the ChiXue Clan would've disposed of him already.

source: 灵魂被攻击到的独眼刀疤，心中更加警惕。
en_us: One-Eyed Scarface, soul having been attacked, was on high guard now.

source: 炼一颗生骨丹所需的灵草要三十种，统统被游小默给扔了进去。
en_us: The thirty different magic herbs that were required to refine a Bone Growth pill were all thrown in by You XiaoMo.

source: 炼丹之前有一个步骤必须做好，那就是将丹方熟记于心，否则也会导致炼丹失败，因此是很重要的一个步骤。
en_us: Before refine pills, one must memorize the pill recipe to heart, otherwise, it would also cause the process to fail. Therefore, it was a critical step.

source: 炼丹房果然才是他的真爱啊！
en_us: In the end, only the Pill Refining Room was his true love!

source: 炼丹是他的看家本领。
en_us: Pill refining was his special skill. (看家本领)

source: 炼丹的过程非常顺利，时间稍微长了一些，灵丹在融合的过程中所花费的时间是提炼灵草的一二倍，精神高度集中已经快三天了，在这个紧要关头，无论如何都不能失败。
en_us: The course of refining the pill went very smoothly. It had taken slightly longer, since the time it took to fuse the magic pill was one or two times the amount it took to refine the magic herbs. He had already concentrated his vigor at a high level for almost three days now, and at this critical moment, he couldn't fail no matter what.

source: 炼丹这种活儿果然需要大毅力，他都辛苦一天了，接下来绝对不允许失败，否则不仅浪费了那么多灵草，他的幸苦也白费了。
en_us: Refining pill really took a lot of willpower. He had painstakingly made it through the first day and now he really couldn't fail, otherwise he would have not only wasted all of the magic herbs but also his efforts.

source: 炼制彩丹耗费的灵魂之力和精力比他预料之中还要大，中途差点支持不下去放弃了，也幸好凌霄没有帮他擦汗，不然真的有可能分散他的注意力。
en_us: The mental and Soul power he needed for the making of a rainbow pill was more than he had expected. He had almost given up in the middle so it was a good thing that Ling Xiao didn't help him wipe off the sweat or he might have actually been distracted.

source: 炼化精血的时候，精血产生抗拒之力，会散发出一种诱人的气味，这种气味对人类的诱惑或许要小一点，但是对妖兽却有着致命的吸引力，因为就算只剩下精血，精血中仍然带着帝王兽的威压。
en_us: While refining the Life Blood, it would produce a resistance and emit a kind of tempting scent. While this scent might be a little less tempting for humans, it held a deadly attraction for demon beasts, since even though the only thing left was the Life Blood, it still carried the oppressive power of an Emperor Beast.

source: 炼狱位于鬼冢山脉，鬼冢山脉在西境很有名，因为那是西境唯一一处没有植被覆盖，到处弥漫着黑雾光秃秃、阴森森的山脉。
en_us: The Purgatory was located in the Ghost Tomb Mountain Range (鬼冢山脉). The Ghost Tomb Mountain Range was famous in Xi Jing because it is the only place in Xi Jing that had no vegetation covering the area. The entire landscape was filled a with dark fog and bare and sinister mountains.

source: 炼狱既然能作为远古的战场，那必然是一个辽阔且醒目的地方，但为了节省时间，游小默抓了几只妖兽，胖揍了他们一顿，他们才哭着告诉他炼狱在哪里。
en_us: Since the Purgatory was viewed as an ancient battlefield, it must definitely be a vast and eye-catching place. However, in the interest of time You XiaoMo caught a few demon beasts and gave them a good beating. Afterwards, they cried and willingly told him where the Purgatory was.

source: 热闹之极的拍卖场慢慢安静了下来，正中央的拍卖台出现一名男子，外表三十几岁，也是黑蜘蛛唯一一位以真面目示人的人。
en_us: The linvely auction house slowly quietened, and a man appeared on the center stage. He seemed around thirty and was the only member of the Black Spider that showed his true face.

source: 热闹的会场随着比赛的开始，几乎没有什么声响，偶尔能听到台上众参赛者面前的炉鼎传来‘噗嗤噗嗤’的声音，比赛时间还没过一半，就有好些人在淬炼的时候失败了。
en_us: As the competition commenced, the rowdy stadium became silent. Occasionally, you could hear the rattle of cauldrons in front of the participants. Not even half the time had passed and some had already failed on the distillation.

source: 然后他如愿的惹怒了游震天和拍卖师。
en_us: Then he had his wish fulfilled as he provoked You ZhenTian and the auctioneer.

source: 然后夫夫俩齐齐的超莫雪看了过去。
en_us: The couple simultaneously looked towards Mo Xue.

source: 然后就像一只骄傲的孔雀走了出去。
en_us: Then he strutted out like a peacock.

source: 然后指示他们分别去什么地方搜，这才分开，唐中华自己也寻着最有可能逃走的方向追了过去。
en_us: Then he instructed them to head to different places to search before dismissing them. Tang ZhongHua himself also headed in the most probable direction that the figure had escaped in.

source: 然后是毛球，她的修为比皮球高五星。
en_us: Then it was MaoQiu, her level was even higher than PiQiu by five stars.

source: 然后是连心蛊，原以为最多增长一两品，不想竟然是一两级，他现在已经是九级上品。
en_us: Then, with the Heart Linking Gu, he had thought he would at most advance a grade or two, never expecting that it would end up a level or two. He was now a level nine high grade mage.

source: 然后，他仿佛看到天刀和天修在心里松了一口气。
en_us: He could almost see Tian Xiu and Tian Dao's inner sighs of relief.

source: 然而下一秒，几簇火苗突然自他们脚下窜起，一瞬间就缠上他们的小腿大腿，接着便散发出一股烤焦的味道，还有姬云琅惨叫的声音。
en_us: But in the next second, a few flickers of flame suddenly burst upwards from their feet, and in a split second, the flames were tangled around their legs. It was followed by the smell of burning flesh and Ji YunLang's screaming.

source: 然而他们都没有料到，最后会被一层结界堵在外面，没有钥匙，除非破坏结界，否则谁也进不去。
en_us: But they hadn't expected that, in the end, they would be block off by a barrier. Without a key, nobody could enter unless they destroyed the barrier.

source: 然而他的话还没说完，一阵仿佛猫叫的尖锐声音突然从湖底传来，湖面的水声到一米多高，下一秒，一群全身透明，带着点诡异青色的怪物从湖底冒出来，尖叫着朝众人扑过去。
en_us: But he hadn't even finished speaking when something like the sharp sound of a cat screaming suddenly came from the bottom of the lake. The water in the lake rose a meter higher before a horde of transparent, strange creatures with a hint of blue appeared from below the lake. They charged, screaming, towards the crowd of people.

source: 然而外面的情况却不像他们想象的那般顺利，因为麟古回来了，除了他，还有丹房的主人天修也提前回来了。
en_us: However, the situation outside wasn't proceeding like they had planned, because Lin Gu had returned. Not only that, the owner of the pill room, Tian Xiu, also came back early.

source: 然而天公鼎却是鼎榜排名第七的炉鼎，其价值完全不是红鹰炉可以对比的，看到这一情形，游小默知道天公鼎被他占大便宜了。
en_us: However, the Heavenly Cauldron was ranked seven on the rankings, it's value wasn't even comparable to the Red Eagle Cauldron. Seeing the situation now, he realized that he really got it for cheap. (大便宜)

source: 然而失去凌霄这个保护伞，游小默绝对不会安全。
en_us: However, if You XiaoMo lost Ling Xiao, his safety helmet (保护伞 ;), he definietly wouldn't be safe anymore.

source: 然而正当它们进入小岛五十米范围的时候，异变发生了，两只猛然跃起的水鲨放佛被一张无形的网切成了数块鲜血淋淋的肉块。
en_us: However, when they came within fifty meters of the small island, something strange happened. Two sharks that had violently leaped out from the water looked as if they were sliced into numerous bloody meat chunks by an intangible net.

source: 然而此刻他终于明白为什么主子让他不要小看凌霄，他现在的处境就是轻视敌人的代价，而这个代价很可能是要付出生命的。
en_us: However, at this moment, he finally understood why the Master asked him not to belittle Ling Xiao. His current situation was the price for belittling the enemy, which was likely to cost him his life.

source: 然而每个到过拍卖会的人都知道，他们的想法是错误的，而且错得离谱，因为拍卖会并不在深山里，反而在中天的一个小镇里，那个小镇就是乌梅镇。
en_us: However, everyone who reached the auction venue knew that their idea was wrong. Moreover, it was so excessively wrong because the auction was not in the mountains, but in a small town in Zhong Tian. That small town was the Ebony Plum Town.

source: 然而没等她的计划开始实施，一个突如其来的消息却无情的击碎了她的计划。
en_us: But her plans hadn't even begun to implemented yet when a sudden piece of news mercilessly smashed her plotting apart.

source: 然而玄盛似乎不太满意这个答案，两道白眉皱了一下又迅速的抚平了，斟酌几秒才说道：“公子确定莫景只是让你们传达这句话，他有没有交给你们什么东西？”
en_us: Yet, Xuan Sheng did not seem too satisfied with this answer. His two white eyebrows furrowed and quickly smoothed out again. Xuan Sheng spoke after several seconds of deliberation, "Sir (公子), are you certain that Mo Jing only asked you to convey this message? Did he pass anything to you?"

source: 然而还是有人不大相信，个个惊疑不定，因为一个六级下品丹师，竟然能炼制出六级上品灵丹，这个玩笑未免开大了吧！
en_us: But some couldn’t believe it. A low grade level six mage refining a high grade pill? What a joke!

source: 然而这名顶级丹师生前却是一个脾气古怪之人，性格阴沉，因此他把洞府建立在一片瘴气之中。
en_us: However, this transcendent level mage was an oddball, with a gloomy personality, when he was alive. Thus, his mansion was built within a field of miasma (瘴气).

source: 然而这种情况却不代表台下没人注意到。
en_us: But this didn’t mean that no one in the audience noticed.

source: 然而通灵玄龟的精血并不是那么好拿的。
en_us: However, the blood essence of Psychic Black Turtle weren't so easy to get.
